<?php

$database = new mysqli('127.0.0.1', 'valeriavh', 'Qwerty-123456', 'valeriavh');
if ($database->connect_error){
	die("Виникла помилка: " .$database->connect_error);
}

$database->set_charset(UTF8);

$sql = "INSERT INTO Students (name, group_name, speciality, DateOfBirth, email) VALUES 
 ('Вікторов Iван Iванович', 'ФБ-91', 'Кiбербезпека', '2000-10-28', 'ivanov@gmail.com'), 
 ('Петренко Михайло Олексійович', 'ФБ-92', 'Кiбербезпека', '2001-04-11', 'рetr@email.com'), 
 ('Костенко Петро Михайлович', 'ФФ-71', 'Прикладна фізика', '1999-11-06', 'kost@gmail.com'), 
 ('Семенченко Семен Петрович', 'ФI-72', 'Прикладна математика', '1999-04-28', 'ivanenko@email.com'), 
 ('Гребельник Олексій Семенович', 'ФБ-92', 'Kібербезпека', '2002-05-08', 'вos@email.com'), 
 ('Менюк Савелій Олександрович', 'ФБ-95', 'Кібербезпека', '2001-11-13', 'sava@gmail.com'), 
 ('Марценюк Іван Семенович', 'ФI-91', 'Прикладна математика', '2002-10-10', 'marcenuk@email.com'), 
 ('Олійниченко Марина Констянтинівна', 'ФФ-81', 'Прикладна фізика', '2000-05-25', 'oln-marina@gmail.com'), 
 ('Куценко Володимир Олегович', 'ФФ-91', 'Прикладна фізика', '2001-06-10', 'vol@gmail.com'), 
 ('Шелудько Анна Петрівна', 'ФБ-81', 'Кібербезпека', '2000-10-28', 'shel@gmail.com'),
 ('Радкевич Олександра Олегівна', 'ФБ-02', 'Кібербезпека', '2003-02-01', 'rad@gmail.com'),
 ('Петренко Марія Василівна', 'ФІ-01', 'Прикладна математика', '2003-05-07', 'ptr-maria@gmail.com'),
 ('Дмитерко Віра Дмитрівна', 'ФФ-82', 'Прикладна фізика', '2000-03-20', 'dmiterko@gmail.com'),
 ('Ліщинська Галина Вікторівна', 'ФФ-71', 'Прикладна фізика', '1998-08-05', 'lgv@gmail.com'),
 ('Забудько Юрій Сергійович', 'ФБ-72', 'Кібербезпека', '1999-04-21', 'zabudko@gmail.com');

	";
	
if ($database->query($sql)==true){
	echo "Дані занесено до таблиці";
}

else{
	echo "Виникла помилка: " .$database->error;
}

?>